[
  {
    "type": "Programming",
    "main": true,
    "list": [
      {
        "name": "PHP",
        "details": [
          "<p class='item-heading'>In concordance with my system skills I can make use of PHP to create an entire web project from scratch. Here are my main key PHP skills:</p>",
          "Server side scripting: from basic system operations like file manipulation to more complex actions like running a process and handling the response;",
          "API implementation: I can create basic REST APIs,",
          "Database manipulation: OOP, CRUD operations, simple table relationships, many to many, one to many etc.;",
          "Client update: using JavaScript I can update pages in real time with backside manipulated data;",
          "Framewroks: Laravel - on a basic level. I can handle routes, database table creation and migrations;"
        ],
        "favourite": true
      },
      {
        "name": "JavaScript",
        "details": [
          "<p class='item-heading'>My main strong skill when it comes to web design. I can create dynamic pages that can enhance user experience and with the help of a server script I can update pages in real time. Here are my main skills: </p>",
          "Dynamic pages: I can make use of Event Listeners to make page elements react to certain actions and create a good user experience;",
          "AJAX: using Fetch or XMLHttpRequest APIs I can request a server side script to either GET (user credentials from a database for a log-in) or POST (a user completed form for account creation) data.",
          "JSON: I can manipulate JSON type files or objects for data storage or API responses;",
          "HTML: I can handle the document methods to create HTML elements for certain purposes like creating a results table for an operation;",
          "pdf.js: a library with asynchronous methods to handle a PDF document: display/count pages;"
        ],
        "favourite": true
      },
      {
        "name": "C++",
        "details": [
          "<p class='item-heading'>I can create intermediate projects with C++</p>",
          "Tesseract OCR Api: Text recognition scripts;",
          "OpenCV: Image processing scripts;"
        ],
        "favourite": true
      },
      {
        "name": "MySQL",
        "details": [
          "<p class='item-heading'>I can create databases for simple applications</p>",
          "Raw SQL: CRUD operations, table column updates;"
        ],
        "favourite": true
      },
      {
        "name": "HTML",
        "details": [
          "<p class='item-heading'>I can create web pages and with the help of CSS selectors I can make a well structured document easy to understand.</p>"
        ]
      },
      {
        "name": "CSS",
        "details": [
          "<p class='item-heading'>I can create good looking webpages with pure CSS or using frameworks such as Bootsrap. Here are a few CSS aspects I am able to handle:</p>",
          "Responsive pages: using flex boxes and media queries to define break points I can create mobile responsive web pages;",
          "Flex boxes: by far the easiest way to style a page. I can create different structures by spliting a container in half or multiple uneven parts;",
          "Navigation menus: I can create nice looking simple or more complex menus;",
          "Animations: hover effects, sliders;"
        ]
      }
    ]
  },
  {
    "type": "Computers",
    "list": [
      {
        "name": "Systems",
        "details": [
          "<p class='item-heading'>I can work with computers that run on systems like Windows or Linux. Basic usage or more complex operations.</p>",
          "Install/update system;",
          "Terminal commands: navigation, file manipulation, run processes, linux bash scripts;"
        ],
        "favourite": true
      },
      {
        "name": "Software",
        "details": [
          "<p class='item-heading'>I have the knwoledge of using computers softwares for different purposes: system update, drivers for specific hardware, engineering aplications, web aplications.</p>",
          "Engineering applications: AutoCAD, Matlab, Ansys Maxwell,Arduino;",
          "Programming applications: GIT, WampServer;",
          "Other: Word, Excel, Jira"
        ],
        "favourite": true
      },
      {
        "name": "Hardware",
        "details": [
          "<p class='item-heading'>I understand how computer components  work and how to assemble them in order to make a computer boot up.</p>",
          "Assembly/dissasembly: remove all the computer parts for maintenance purposes such as dust cleaning, thermal paste replacement."
        ]
      },
      {
        "name": "Server",
        "details": [
          "<p class='item-heading'>Web applications development on remote servers by installing necesarry software and configuring them.</p>",
          "Remote connection: I can connect to a remote server using certain applications like PuTTY, SSH or FTP methods;",
          "Apache: I can install and configure and Apache server in order to run a web application;",
          "PostFix: mail server install and configuration;"
        ]
      }
    ]
  },
  {
    "type": "Electronics",
    "list": [
      {
        "name": "Basic Electronics:",
        "details": [
          "<p class='item-heading'>I have knowledge about electronics and how compenents work and I can put them togheter to create simple circuits.</p>"
        ]
      },
      {
        "name": "PCB Repair",
        "details": [
          "<p class='item-heading'>I have knowledge and abilities on how to use heating devices such as a ledcon to remove/replace PCB components.</p>"
        ]
      }
    ]
  }
]
